{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "filters": 32, "data_format": "channels_last", "batch_input_shape": [null, 64, 64, 3], "bias_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "strides": [1, 1], "dtype": "float32", "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}], "keras_version": "2.1.2"}